//错误日志各种状态
const ERRSTATE = {
    ERR_1:1,                                    //开局超时
    ERR_3:3,                                    //游戏结果超时
    ERR_4:4,                                    //机器下抓超时
    ERR_5:5,                                    //房间出现异常卡住了
    ERR_6:6,                                    //长时间收不到机器心跳包
    ERR_10:10,                                  //发生未知错误
    ERR_11:11,                                  //连接断开了
    ERR_12:12,                                  //关闭了连接
    ERR_13:13,                                  //连接被闲置
    ERR_14:14,                                  //数据包第一位变成0XFE就完整了
    ERR_15:15,                                  //数据包残缺
    ERR_16:16,                                  //心跳包缺少
    ERR_17:17,                                  //心跳包恢复
	ERR_18:18,                                  //查询心跳包超时-列入可疑对象
	ERR_19:19,                                  //服务器重启了
}


module.exports = { ERRSTATE }
